In [2]:
import pandas as pd

In [3]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [6]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [7]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
from operator import index
import numpy as np


frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                     index = ['a', 'c', 'd'],
                     columns= ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [10]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [11]:
states = ['Texas', 'Utah', 'California']

In [12]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [13]:
# frame.loc[['a', 'b', 'c', 'd'], states]

## Dropping Entries from an Axis

In [14]:
obj = pd.Series(np.arange(5), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [15]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [16]:
obj.drop(['c', 'd'])

a    0
b    1
e    4
dtype: int32

In [17]:
states = ['Ohio', 'Colorado', 'Utah', 'New York']
numbers = ['one', 'two', 'three', 'four']
data = pd.DataFrame(np.arange(16).reshape(4,4) ,index=states, columns=numbers)

In [18]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [20]:
data.drop('one', axis = 'columns')

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [21]:
data.drop(['two', 'one'], axis = 'columns')

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [22]:
obj.drop('c', inplace =True)

In [23]:
obj

a    0
b    1
d    3
e    4
dtype: int32

In [24]:
obj = pd.Series(np.arange(4), index = ['a', 'b', 'c', 'd'])

In [25]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [26]:
obj['b':]

b    1
c    2
d    3
dtype: int32

In [27]:
obj[:'b']

a    0
b    1
dtype: int32

In [28]:
obj[2]

2

In [29]:
obj[['a', 'b', 'c']] #  OJO

a    0
b    1
c    2
dtype: int32

In [30]:
obj['b':'d'] # El slicing es inclusivo OJO

b    1
c    2
d    3
dtype: int32

In [31]:
obj['b':'c'] = 5

In [32]:
obj

a    0
b    5
c    5
d    3
dtype: int32

In [33]:
data = pd.DataFrame(np.arange(16).reshape(4,4), index = states, columns = numbers)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data > 3

            one    two  three   four
Ohio      False  False  False  False
Colorado   True   True   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [35]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [36]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [37]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [38]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [39]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [40]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [41]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [42]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [43]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [44]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [45]:
ser2[-1]

2.0

In [46]:
ser-[1]

0   -1.0
1    0.0
2    1.0
dtype: float64

In [47]:
ser[:1]

0    0.0
dtype: float64

In [48]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [49]:
ser.iloc[:1]

0    0.0
dtype: float64

## Arithmetic and Data Alignment

In [50]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [51]:
s1 + s2 # Funciona como un inner join

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [52]:
df1 = pd.DataFrame(np.arange(9.).reshape([3, 3]), columns = list('bcd'),
                   index = ['Ohio', 'Texas', 'Colarado'])
df2 = pd.DataFrame(np.arange(12.).reshape([4, 3]), columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [53]:
df1 + df2 # Mismo comportamiento que en Series

            b   c     d   e
Colarado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [54]:
df1, df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colarado  6.0  7.0  8.0,
           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [55]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [56]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [57]:
df1 = pd.DataFrame(np.arange(12.).reshape(3, 4),
                   columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape(4, 5),
                   columns = list('abcde'))

In [58]:
df2.loc[1, 'b'] = np.nan

In [59]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [60]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [61]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [62]:
# Rellenar valores con 0
df1.add(df2, fill_value=0) # add es para sumar dos dataframes

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [63]:
1 / df1 # Se le aplica a cada elemento

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [64]:
y = (1 / df1).loc[0, 'a']

In [65]:
y + 1

inf

In [66]:
y + 1 == y

True

In [67]:
y > 1

True

In [68]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [69]:
df1.rdiv(1) == 1 / df1

      a     b     c     d
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True

In [70]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

## Function Application and Mapping

In [71]:
frame = pd.DataFrame(np.random.randn(4, 3), columns = list('bde'), 
                     index = ['Utah', 'Ohio', 'Texas', 'Oregan'])

In [72]:
np.abs(frame)

               b         d         e
Utah    0.662232  0.054624  0.631713
Ohio    0.769621  0.323476  0.143909
Texas   1.480890  0.016866  0.094452
Oregan  1.117724  1.853974  2.064785

In [73]:
frame

               b         d         e
Utah   -0.662232 -0.054624  0.631713
Ohio    0.769621  0.323476 -0.143909
Texas   1.480890 -0.016866 -0.094452
Oregan  1.117724 -1.853974  2.064785

In [74]:
f = lambda x: x.max() - x.abs()

In [75]:
frame.apply(f)

               b         d         e
Utah    0.818658  0.268852  1.433072
Ohio    0.711269  0.000000  1.920876
Texas   0.000000  0.306610  1.970333
Oregan  0.363166 -1.530499  0.000000

In [76]:
f2 = lambda x: x.max() - x.min()

In [77]:
frame.apply(f2)

b    2.143122
d    2.177450
e    2.208694
dtype: float64

In [78]:
dos_mas_tres = 2 + \
    3

In [79]:
dos_mas_tres

5

In [81]:
frame

               b         d         e
Utah   -0.662232 -0.054624  0.631713
Ohio    0.769621  0.323476 -0.143909
Texas   1.480890 -0.016866 -0.094452
Oregan  1.117724 -1.853974  2.064785

In [80]:
frame.apply(f, axis = 'columns')

               b         d         e
Utah   -0.030519  0.577089  0.000000
Ohio    0.000000  0.446145  0.625712
Texas   0.000000  1.464024  1.386438
Oregan  0.947061  0.210810  0.000000

In [84]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [85]:
frame.apply(f)

            b         d         e
min -0.662232 -1.853974 -0.143909
max  1.480890  0.323476  2.064785

In [87]:
format = lambda x: '%.2f' % x

In [89]:
frame.applymap(format)

            b      d      e
Utah    -0.66  -0.05   0.63
Ohio     0.77   0.32  -0.14
Texas    1.48  -0.02  -0.09
Oregan   1.12  -1.85   2.06

In [90]:
frame['e'].map(format)

Utah       0.63
Ohio      -0.14
Texas     -0.09
Oregan     2.06
Name: e, dtype: object

## Sorting and Ranking

In [94]:
obj = pd.DataFrame(range(4), index = ['d', 'b', 'c', 'a'])

In [95]:
obj.sort_index() # Ordena de forma alfabtica los ndices

   0
a  3
b  1
c  2
d  0

In [104]:
frame = pd.DataFrame(np.arange(8).reshape([2, 4]),
                     index = ['three', 'one'],
                     columns = ['d', 'a', 'b', 'c'])

In [105]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [106]:
frame.sort_index(axis = 1) # Ordena las columnas

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [107]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [108]:
obj = pd.Series([4, 7, -3, 2])

In [109]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [110]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [111]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [119]:
frame = pd.DataFrame({'b' : [4, 7, -3, 2], 'a' : [0, 1, 0, 1]})

In [120]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [121]:
frame.sort_values(by = 'b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [123]:
frame.sort_values(by = ['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

### Ranking

In [124]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [125]:
obj.rank() # Le asigna 1 al valor ms pequeo y n al ms grande, si existen valores repetidos, hace una media de la posicin en el rango de estos

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [126]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [129]:
obj.rank(method = 'first') # Lo asigna segn cul vea primero

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [131]:
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [136]:
# # Tambin rank puede ser utilizado sobre las filas de las columnas en un DataFrame
frame = pd.DataFrame({'b' : [4, 7, -3, 2], 'a' : [0, 1, 0, 1],
                     'c' : [-2, 5, 8, -2.5]})
frame

   b  a    c
0  4  0 -2.0
1  7  1  5.0
2 -3  0  8.0
3  2  1 -2.5

In [134]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [135]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

## Axis Indexes with Duplicate Labels

In [137]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [138]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [139]:
# Existe una propiedad para decir si un label es nico o no:
obj.index.is_unique

False

In [141]:
obj['a']

(a    0
 a    1
 dtype: int64,
 4)

In [142]:
obj['c']

4

In [143]:
df = pd.DataFrame(np.random.randn(4, 3), index = ['a', 'a', 'b', 'b'])

In [144]:
df

          0         1         2
a -0.889318  0.293236  0.673023
a -1.578546 -0.378263  0.725063
b -0.214164  0.526705 -0.369776
b -0.241259  1.451286  0.451169

In [145]:
df.loc['b']

          0         1         2
b -0.214164  0.526705 -0.369776
b -0.241259  1.451286  0.451169